app/controllers/holidays_controller.rb

SELECT * FROM "holidays"
---
  def index
    @holidays = Holiday.all

SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)
---
  def show
    @holiday = Holiday.find(params[:id])

INSERT INTO "holidays" ("dateto", "number_of_days", "created_at", "updated_at", "datefrom") VALUES('2012-01-27', NULL, '2012-01-19 17:15:52', '2012-01-19 17:15:52', '2012-01-19')
---
  def create
    @holiday = Holiday.new(params[:holiday])
    @holiday.user_id = current_user.id
    if @holiday.save

SELECT * FROM "holidays" WHERE ("holidays"."id" = 2)
---
  def edit
    @holiday = Holiday.find(params[:id])

SELECT * FROM "holidays" WHERE ("holidays"."id" = 2)
---
  def update
    @holiday = Holiday.find(params[:id])

SELECT * FROM "holidays" WHERE ("holidays"."id" = 3)
DELETE FROM "holidays" WHERE "id" = 3
---
  def destroy
    @holiday = Holiday.find(params[:id])
    @holiday.destroy